In [20]:
import pandas as pd
import numpy as np

In [21]:
df = pd.DataFrame(np.arange(12).reshape(3, 4),columns=['A', 'B', 'C', 'D'])

In [22]:
df

   A  B   C   D
0  0  1   2   3
1  4  5   6   7
2  8  9  10  11

In [23]:
df1 = df.drop(['B', 'C'], axis=1)
df1

   A   D
0  0   3
1  4   7
2  8  11

In [24]:
df3 = df.drop([0, 1])
df3

   A  B   C   D
2  8  9  10  11

inplace=True